openfoam/OpenFOAM-dev/tutorials/fluid/annularThermalMixer/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "${FOAM_CASE}/constant/caseSettings"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    innerInlet
    {
        type            fixedValue;
        value           uniform $!innerInlet/U;
    }

    outerInlet
    {
        type            fixedValue;
        value           uniform $!outerInlet/U;
    }

    outlet
    {
        $!outlet/U;
    }

    staticWalls
    {
        $!wall/U;
    }

    movingWalls
    {
        $!movingWall/U;
    }

    nonCouple
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
